rpouetpouet/geekmagic-tv-esp8266/src/display.cpp
#include "display.h"

#include "auth.h"
#include "config.h"
#include "feeds.h"
#include "logger.h"
#include <ESP8266WiFi.h>
#include <LittleFS.h>
#include <picojpeg.h>
#include <time.h>
#include <vector>

#define FONT_INFO 1
#define FONT_LABEL 2
#define FONT_BODY 4
#define FONT_TITLE 6
#define FONT_HUGE 7

TFT_eSPI tft = TFT_eSPI();
TFT_eSprite clockDynamicSprite = TFT_eSprite(&tft);
DisplayState displayState;
int scrollPos = 240;

namespace {

constexpr uint16_t rgb565(uint8_t red, uint8_t green, uint8_t blue) {
    return ((red & 0xF8) << 8) | ((green & 0xFC) << 3) | (blue >> 3);
}

constexpr int kPageMargin = 4;
constexpr int kPageWidth = DISPLAY_WIDTH - (kPageMargin * 2);
constexpr int kHeaderTitleY = 10;
constexpr int kHeaderSubtitleY = 12;
constexpr int kHeaderRuleY = 32;
constexpr int kContentTopY = 40;
constexpr int kClockDynamicRegionX = 12;
constexpr int kClockDynamicRegionY = 44;
constexpr int kClockDynamicRegionWidth = DISPLAY_WIDTH - (kClockDynamicRegionX * 2);
constexpr int kClockDynamicRegionHeight = 64;
constexpr int kClockTimeY = 54;
constexpr int kClockMetaY = 118;
constexpr int kClockFooterY = 148;
constexpr int kClockFooterHeight = 78;
constexpr uint32_t kClockSpriteMinFreeHeapBytes = 30000UL;
constexpr uint8_t kPageTransitionFadeDownSteps = 2;
constexpr uint8_t kPageTransitionFadeUpSteps = 3;
constexpr uint16_t kPageTransitionFadeStepDelayMs = 12;
constexpr uint8_t kPageTransitionDimPercent = 82;
constexpr uint8_t kPageTransitionMinimumBrightness = 18;
constexpr size_t kTemporaryMessageBufferSize = 96;

struct ThemePalette {
    uint16_t background;
    uint16_t surface;
    uint16_t surfaceAlt;
    uint16_t accent;
    uint16_t accentSoft;
    uint16_t text;
    uint16_t muted;
    uint16_t positive;
    uint16_t negative;
    uint16_t warning;
};

struct Rgb888 {
    uint8_t red;
    uint8_t green;
    uint8_t blue;
};

struct ThemeSelection {
    uint8_t theme;
    bool customThemeEnabled;
    const char *background;
    const char *surface;
    const char *accent;
    const char *text;
};

const ThemePalette kThemes[DASHBOARD_THEME_COUNT] = {
    {
        rgb565(15, 18, 27),
        rgb565(29, 35, 47),
        rgb565(39, 46, 60),
        rgb565(168, 199, 250),
        rgb565(44, 66, 104),
        rgb565(236, 241, 251),
        rgb565(173, 182, 197),
        rgb565(123, 214, 167),
        rgb565(255, 180, 171),
        rgb565(255, 210, 128),
    },
    {
        rgb565(33, 16, 11),
        rgb565(61, 34, 26),
        rgb565(74, 43, 32),
        rgb565(255, 183, 77),
        rgb565(118, 75, 35),
        rgb565(255, 239, 232),
        rgb565(224, 189, 173),
        rgb565(151, 221, 168),
        rgb565(255, 172, 162),
        rgb565(255, 214, 120),
    },
    {
        rgb565(9, 18, 14),
        rgb565(19, 36, 28),
        rgb565(26, 47, 37),
        rgb565(165, 230, 174),
        rgb565(47, 83, 60),
        rgb565(232, 247, 236),
        rgb565(160, 188, 170),
        rgb565(137, 230, 164),
        rgb565(255, 169, 169),
        rgb565(233, 241, 129),
    },
};

int savedBrightness = 100;
int appliedBrightness = -1;
bool backlightOn = true;

enum DisplayRenderMode : uint8_t {
    DISPLAY_MODE_DASHBOARD = 0,
    DISPLAY_MODE_TEMP_MESSAGE,
    DISPLAY_MODE_AP,
    DISPLAY_MODE_IMAGE
};

struct RenderCache {
    bool valid;
    uint8_t mode;
    uint8_t page;
    uint8_t theme;
    uint32_t staticHash;
    uint32_t dynamicHash;
    char imagePath[DISPLAY_PATH_BUFFER_SIZE];
};

RenderCache renderCache = {false, DISPLAY_MODE_DASHBOARD, 0, 0, 0, 0, {0}};

struct ClockMetaCache {
    bool valid;
    char metaLine[40];
};

ClockMetaCache clockMetaCache = {false, {0}};
bool clockDynamicSpriteReady = false;
bool clockDynamicSpriteAttempted = false;
bool clockDynamicSpriteAllowed = false;
bool resumeClockSpriteAfterDynamicSuspend = false;
uint8_t dynamicResourceSuspendDepth = 0;

struct TemporaryMessageState {
    bool active;
    unsigned long expiresAtMs;
    char message[kTemporaryMessageBufferSize];
};

TemporaryMessageState temporaryMessage = {false, 0, {0}};

constexpr uint32_t kFnvOffset = 2166136261UL;
constexpr uint32_t kFnvPrime = 16777619UL;

void hashBytes(uint32_t &hash, const uint8_t *data, size_t length) {
    for (size_t index = 0; index < length; ++index) {
        hash ^= data[index];
        hash *= kFnvPrime;
    }
}

template <typename TValue>
void hashValue(uint32_t &hash, const TValue &value) {
    hashBytes(hash, reinterpret_cast<const uint8_t*>(&value), sizeof(TValue));
}

void hashCString(uint32_t &hash, const char *value) {
    if (value == nullptr) {
        const uint8_t zero = 0;
        hashBytes(hash, &zero, sizeof(zero));
        return;
    }

    hashBytes(hash, reinterpret_cast<const uint8_t*>(value), strlen(value));
    const uint8_t terminator = 0;
    hashBytes(hash, &terminator, sizeof(terminator));
}

void invalidateRenderCache() {
    renderCache.valid = false;
    renderCache.imagePath[0] = '\0';
    clockMetaCache.valid = false;
    clockMetaCache.metaLine[0] = '\0';
}

void clearTemporaryMessage() {
    temporaryMessage.active = false;
    temporaryMessage.expiresAtMs = 0;
    temporaryMessage.message[0] = '\0';
}

bool temporaryMessageExpired() {
    return temporaryMessage.active &&
           static_cast<long>(millis() - temporaryMessage.expiresAtMs) >= 0;
}

bool temporaryMessageVisible() {
    return temporaryMessage.active &&
           temporaryMessage.message[0] != '\0' &&
           !temporaryMessageExpired();
}

Rgb888 rgb565ToRgb888(uint16_t color) {
    Rgb888 rgb;
    rgb.red = static_cast<uint8_t>(((color >> 11) & 0x1F) * 255 / 31);
    rgb.green = static_cast<uint8_t>(((color >> 5) & 0x3F) * 255 / 63);
    rgb.blue = static_cast<uint8_t>((color & 0x1F) * 255 / 31);
    return rgb;
}

uint16_t rgb888ToRgb565(const Rgb888 &rgb) {
    return rgb565(rgb.red, rgb.green, rgb.blue);
}

bool parseHexColor888(const char *value, Rgb888 &rgb) {
    if (value == nullptr) {
        return false;
    }

    const char *source = value[0] == '#' ? value + 1 : value;
    if (strlen(source) != 6) {
        return false;
    }

    char *end = nullptr;
    unsigned long raw = strtoul(source, &end, 16);
    if (end == nullptr || *end != '\0') {
        return false;
    }

    rgb.red = static_cast<uint8_t>((raw >> 16) & 0xFF);
    rgb.green = static_cast<uint8_t>((raw >> 8) & 0xFF);
    rgb.blue = static_cast<uint8_t>(raw & 0xFF);
    return true;
}

Rgb888 blendRgb(const Rgb888 &base, const Rgb888 &mix, uint8_t mixWeightPercent) {
    uint16_t baseWeight = 100U - constrain(mixWeightPercent, 0, 100);
    uint16_t mixWeight = constrain(mixWeightPercent, 0, 100);

    Rgb888 result;
    result.red = static_cast<uint8_t>((base.red * baseWeight + mix.red * mixWeight) / 100U);
    result.green = static_cast<uint8_t>((base.green * baseWeight + mix.green * mixWeight) / 100U);
    result.blue = static_cast<uint8_t>((base.blue * baseWeight + mix.blue * mixWeight) / 100U);
    return result;
}

ThemeSelection effectiveThemeSelection() {
    if (dashboardNightModeActive() && dashboardConfig.nightThemeEnabled) {
        return {
            dashboardConfig.nightTheme,
            dashboardConfig.nightCustomThemeEnabled,
            dashboardConfig.nightCustomBackground,
            dashboardConfig.nightCustomSurface,
            dashboardConfig.nightCustomAccent,
            dashboardConfig.nightCustomText
        };
    }

    return {
        dashboardConfig.theme,
        dashboardConfig.customThemeEnabled,
        dashboardConfig.customBackground,
        dashboardConfig.customSurface,
        dashboardConfig.customAccent,
        dashboardConfig.customText
    };
}

