rpouetpouet/geekmagic-tv-esp8266/src/display.cpp
uint8_t activeThemeIdValue() {
    ThemeSelection selection = effectiveThemeSelection();
    return constrain(selection.theme, 0, DASHBOARD_THEME_COUNT - 1);
}

ThemePalette buildCustomTheme(const ThemePalette &base,
                              const char *backgroundColor,
                              const char *surfaceColor,
                              const char *accentColor,
                              const char *textColor) {
    Rgb888 background = rgb565ToRgb888(base.background);
    Rgb888 surface = rgb565ToRgb888(base.surface);
    Rgb888 accent = rgb565ToRgb888(base.accent);
    Rgb888 text = rgb565ToRgb888(base.text);

    parseHexColor888(backgroundColor, background);
    parseHexColor888(surfaceColor, surface);
    parseHexColor888(accentColor, accent);
    parseHexColor888(textColor, text);

    ThemePalette theme = {};
    theme.background = rgb888ToRgb565(background);
    theme.surface = rgb888ToRgb565(surface);
    theme.surfaceAlt = rgb888ToRgb565(blendRgb(surface, background, 22));
    theme.accent = rgb888ToRgb565(accent);
    theme.accentSoft = rgb888ToRgb565(blendRgb(surface, accent, 28));
    theme.text = rgb888ToRgb565(text);
    theme.muted = rgb888ToRgb565(blendRgb(text, background, 52));
    theme.positive = base.positive;
    theme.negative = base.negative;
    theme.warning = base.warning;
    return theme;
}

void hashThemeConfig(uint32_t &hash) {
    ThemeSelection selection = effectiveThemeSelection();
    hashValue(hash, selection.theme);
    hashValue(hash, selection.customThemeEnabled);
    if (!selection.customThemeEnabled) {
        return;
    }

    hashCString(hash, selection.background);
    hashCString(hash, selection.surface);
    hashCString(hash, selection.accent);
    hashCString(hash, selection.text);
}

const ThemePalette& activeTheme() {
    static ThemePalette customTheme;
    ThemeSelection selection = effectiveThemeSelection();
    uint8_t themeIndex = constrain(selection.theme, 0, DASHBOARD_THEME_COUNT - 1);
    if (!selection.customThemeEnabled) {
        return kThemes[themeIndex];
    }

    customTheme = buildCustomTheme(kThemes[themeIndex],
                                   selection.background,
                                   selection.surface,
                                   selection.accent,
                                   selection.text);
    return customTheme;
}

String safeCString(const char *value) {
    return (value != nullptr) ? String(value) : String("");
}

bool hasTimeSync() {
    return dashboardCurrentEpoch() != 0;
}

String trimTrailingZeros(float value, uint8_t precision = 2) {
    String result(value, precision);
    while (result.endsWith("0")) {
        result.remove(result.length() - 1);
    }
    if (result.endsWith(".")) {
        result.remove(result.length() - 1);
    }
    return result;
}

String groupThousands(const String &value) {
    int decimalIndex = value.indexOf('.');
    if (decimalIndex < 0) {
        decimalIndex = value.length();
    }

    int startIndex = value.startsWith("-") ? 1 : 0;
    if (decimalIndex - startIndex <= 3) {
        return value;
    }

    String grouped;
    grouped.reserve(value.length() + ((decimalIndex - startIndex - 1) / 3));
    if (startIndex == 1) {
        grouped += '-';
    }

    for (int index = startIndex; index < static_cast<int>(value.length()); ++index) {
        grouped += value.charAt(index);

        if (index < decimalIndex - 1) {
            int remainingDigits = decimalIndex - index - 1;
            if (remainingDigits > 0 && (remainingDigits % 3) == 0) {
                grouped += ',';
            }
        }
    }

    return grouped;
}

String formatTimeForTm(const tm &timeInfo, bool showSeconds, bool use24Hour, bool *isPm = nullptr) {
    char buffer[16];
    const char *format = nullptr;

    if (use24Hour) {
        format = showSeconds ? "%H:%M:%S" : "%H:%M";
    } else {
        format = showSeconds ? "%I:%M:%S" : "%I:%M";
        if (isPm != nullptr) {
            *isPm = timeInfo.tm_hour >= 12;
        }
    }

    strftime(buffer, sizeof(buffer), format, &timeInfo);
    return String(buffer);
}

String formatLocalTime(bool showSeconds, bool use24Hour, bool *isPm = nullptr) {
    if (!hasTimeSync()) {
        if (isPm != nullptr) {
            *isPm = false;
        }
        return showSeconds ? "--:--:--" : "--:--";
    }

    time_t now = time(nullptr);
    tm localTimeInfo;
    localtime_r(&now, &localTimeInfo);
    return formatTimeForTm(localTimeInfo, showSeconds, use24Hour, isPm);
}

String formatLocalDate() {
    if (!hasTimeSync()) {
        return "Waiting for time";
    }

    char buffer[32];
    time_t now = time(nullptr);
    tm localTimeInfo;
    localtime_r(&now, &localTimeInfo);
    strftime(buffer, sizeof(buffer), "%a %d %b %Y", &localTimeInfo);
    return String(buffer);
}

String formatWorldTime(long offsetSeconds) {
    if (!hasTimeSync()) {
        return "--:--";
    }

    time_t now = time(nullptr) + offsetSeconds;
    tm utcTimeInfo;
    gmtime_r(&now, &utcTimeInfo);
    return formatTimeForTm(utcTimeInfo, false, dashboardConfig.use24Hour);
}

String formatDuration(int32_t totalSeconds) {
    int32_t boundedSeconds = (totalSeconds > 0) ? totalSeconds : 0;
    int32_t hours = boundedSeconds / 3600;
    int32_t minutes = (boundedSeconds % 3600) / 60;
    int32_t seconds = boundedSeconds % 60;

    char buffer[16];
    if (hours > 0) {
        snprintf(buffer, sizeof(buffer), "%ld:%02ld", static_cast<long>(hours), static_cast<long>(minutes));
    } else {
        snprintf(buffer, sizeof(buffer), "%02ld:%02ld", static_cast<long>(minutes), static_cast<long>(seconds));
    }
    return String(buffer);
}

String formatRelativeCountdown(int32_t totalSeconds) {
    int32_t boundedSeconds = (totalSeconds > 0) ? totalSeconds : 0;
    if (boundedSeconds <= 0) {
        return "Now";
    }

    int32_t hours = boundedSeconds / 3600;
    int32_t minutes = (boundedSeconds % 3600) / 60;

    if (hours > 0) {
        return "in " + String(hours) + "h " + String(minutes) + "m";
    }

    return "in " + String((minutes > 1) ? minutes : 1) + "m";
}

String formatUtcOffset(long offsetSeconds) {
    long absoluteSeconds = labs(offsetSeconds);
    long hours = absoluteSeconds / 3600;
    long minutes = (absoluteSeconds % 3600) / 60;
    char buffer[16];
    snprintf(buffer, sizeof(buffer), "UTC%c%02ld:%02ld",
             offsetSeconds >= 0 ? '+' : '-',
             hours,
             minutes);
    return String(buffer);
}

