rpouetpouet/geekmagic-tv-esp8266/src/display.cpp
String formatClockMetaLine(bool isPm) {
    String metaLine = formatLocalDate();
    if (!dashboardConfig.use24Hour && hasTimeSync()) {
        metaLine += isPm ? "  PM" : "  AM";
    }
    return metaLine;
}

void updateClockMetaCache(const String &metaLine) {
    strncpy(clockMetaCache.metaLine, metaLine.c_str(), sizeof(clockMetaCache.metaLine) - 1);
    clockMetaCache.metaLine[sizeof(clockMetaCache.metaLine) - 1] = '\0';
    clockMetaCache.valid = true;
}

template <typename TCanvas>
int chooseCanvasFittingFont(TCanvas &canvas,
                            const String &text,
                            int maxWidth,
                            const int *fontCandidates,
                            size_t fontCandidateCount) {
    if (fontCandidates == nullptr || fontCandidateCount == 0) {
        return FONT_INFO;
    }

    for (size_t index = 0; index < fontCandidateCount; ++index) {
        int font = fontCandidates[index];
        if (canvas.textWidth(text, font) <= maxWidth) {
            return font;
        }
    }

    return fontCandidates[fontCandidateCount - 1];
}

template <typename TCanvas>
void drawClockTime(TCanvas &canvas,
                   const String &timeText,
                   bool showSeconds,
                   uint16_t primaryColor,
                   uint16_t secondaryColor,
                   uint16_t backgroundColor,
                   int centerX,
                   int topY) {
    (void)secondaryColor;
    const int timeFonts[] = {FONT_HUGE, FONT_TITLE, FONT_BODY};
    int maxWidth = max(0, (centerX * 2) - (showSeconds ? 8 : 20));
    int timeFont = chooseCanvasFittingFont(canvas,
                                           timeText,
                                           maxWidth,
                                           timeFonts,
                                           sizeof(timeFonts) / sizeof(timeFonts[0]));

    canvas.setTextDatum(TL_DATUM);
    canvas.setTextFont(FONT_HUGE);
    int referenceHeight = canvas.fontHeight();

    canvas.setTextColor(primaryColor, backgroundColor);
    canvas.setTextFont(timeFont);
    int textWidth = canvas.textWidth(timeText, timeFont);
    int textHeight = canvas.fontHeight();
    int adjustedTopY = topY + max(0, (referenceHeight - textHeight) / 2);
    int startX = centerX - (textWidth / 2);
    canvas.drawString(timeText, startX, adjustedTopY, timeFont);
}

String headerSubtitle() {
    if (displayState.apMode && displayState.ipInfo[0] != '\0') {
        return safeCString(displayState.ipInfo);
    }

    if (!dashboardConfig.showIp) {
        return "";
    }

    if (displayState.ipInfo[0] != '\0') {
        return safeCString(displayState.ipInfo);
    }

    return "";
}

std::vector<String> wrapText(const String &text, int font, int maxWidth) {
    std::vector<String> lines;

    if (text.isEmpty()) {
        lines.push_back("");
        return lines;
    }

    tft.setTextFont(font);
    String currentLine;
    String currentWord;
    currentLine.reserve(text.length() + 4);
    currentWord.reserve(text.length() + 4);

    auto flushWord = [&](bool forceLineBreak) {
        if (currentWord.isEmpty()) {
            return;
        }

        String candidate = currentLine;
        if (!candidate.isEmpty()) {
            candidate += " ";
        }
        candidate += currentWord;

        if (forceLineBreak || tft.textWidth(candidate) > maxWidth) {
            if (!currentLine.isEmpty()) {
                lines.push_back(currentLine);
                currentLine = currentWord;
            } else {
                lines.push_back(currentWord);
                currentLine = "";
            }
        } else {
            currentLine = candidate;
        }

        currentWord = "";
    };

    for (size_t index = 0; index < text.length(); ++index) {
        char character = text.charAt(index);

        if (character == '\n') {
            flushWord(false);
            lines.push_back(currentLine);
            currentLine = "";
        } else if (character == ' ') {
            flushWord(false);
        } else {
            currentWord += character;
        }
    }

    flushWord(false);
    if (!currentLine.isEmpty()) {
        lines.push_back(currentLine);
    }

    if (lines.empty()) {
        lines.push_back("");
    }

    return lines;
}

void drawRoundedPanel(int x, int y, int width, int height, uint16_t fillColor, uint16_t borderColor) {
    tft.fillRoundRect(x, y, width, height, 18, fillColor);
    tft.drawRoundRect(x, y, width, height, 18, borderColor);
}

void drawBadge(int x, int y, int width, int height, const String &label, uint16_t fillColor, uint16_t textColor) {
    tft.fillRoundRect(x, y, width, height, height / 2, fillColor);
    tft.setTextDatum(MC_DATUM);
    tft.setTextFont(FONT_LABEL);
    tft.setTextColor(textColor, fillColor);
    tft.drawString(label, x + (width / 2), y + (height / 2), FONT_LABEL);
}

void drawWrappedCenteredText(const String &text,
                             int centerX,
                             int startY,
                             int maxWidth,
                             int font,
                             uint16_t textColor,
                             uint16_t backgroundColor,
                             int lineSpacing = 4) {
    std::vector<String> lines = wrapText(text, font, maxWidth);
    tft.setTextDatum(TC_DATUM);
    tft.setTextFont(font);
    tft.setTextColor(textColor, backgroundColor);
    int lineHeight = tft.fontHeight() + lineSpacing;

    for (size_t lineIndex = 0; lineIndex < lines.size(); ++lineIndex) {
        tft.drawString(lines[lineIndex], centerX, startY + (lineIndex * lineHeight), font);
    }
}

int chooseFittingFont(const String &text, int maxWidth, const int *fontCandidates, size_t fontCandidateCount) {
    if (fontCandidates == nullptr || fontCandidateCount == 0) {
        return FONT_INFO;
    }

    for (size_t index = 0; index < fontCandidateCount; ++index) {
        int font = fontCandidates[index];
        if (tft.textWidth(text, font) <= maxWidth) {
            return font;
        }
    }

    return fontCandidates[fontCandidateCount - 1];
}

void drawAdaptiveBadge(int x,
                       int y,
                       int width,
                       int height,
                       const String &label,
                       const int *fontCandidates,
                       size_t fontCandidateCount,
                       uint16_t fillColor,
                       uint16_t textColor,
                       int textYOffset = 0) {
    tft.fillRoundRect(x, y, width, height, height / 2, fillColor);
    tft.setTextDatum(MC_DATUM);

    int font = chooseFittingFont(label, max(0, width - 12), fontCandidates, fontCandidateCount);
    tft.setTextFont(font);
    tft.setTextColor(textColor, fillColor);
    tft.drawString(label, x + (width / 2), y + (height / 2) + textYOffset, font);
}

void drawAdaptiveText(const String &text,
                      int x,
                      int y,
                      int maxWidth,
                      uint8_t datum,
                      const int *fontCandidates,
                      size_t fontCandidateCount,
                      uint16_t textColor,
                      uint16_t backgroundColor) {
    int font = chooseFittingFont(text, maxWidth, fontCandidates, fontCandidateCount);
    tft.setTextDatum(datum);
    tft.setTextFont(font);
    tft.setTextColor(textColor, backgroundColor);
    tft.drawString(text, x, y, font);
}

void drawDividerLine(int x, int y, int width, uint16_t color) {
    tft.drawFastHLine(x, y, width, color);
}

void drawDividerColumn(int x, int y, int height, uint16_t color) {
    tft.drawFastVLine(x, y, height, color);
}

