rpouetpouet/geekmagic-tv-esp8266/src/display.cpp
void drawMetricColumn(int centerX,
                      int topY,
                      const String &label,
                      const String &value,
                      uint16_t labelColor,
                      uint16_t valueColor,
                      uint16_t backgroundColor) {
    tft.setTextDatum(TC_DATUM);
    tft.setTextFont(FONT_INFO);
    tft.setTextColor(labelColor, backgroundColor);
    tft.drawString(label, centerX, topY, FONT_INFO);

    const int valueFonts[] = {FONT_BODY, FONT_LABEL, FONT_INFO};
    drawAdaptiveText(value,
                     centerX,
                     topY + 16,
                     58,
                     TC_DATUM,
                     valueFonts,
                     sizeof(valueFonts) / sizeof(valueFonts[0]),
                     valueColor,
                     backgroundColor);
}

void drawScreenChrome(const String &title) {
    const ThemePalette &theme = activeTheme();
    const int chromeX = 10;
    const int chromeY = 10;
    const int chromeWidth = 220;
    const int chromeHeight = 26;

    tft.fillScreen(theme.background);
    tft.fillRoundRect(chromeX, chromeY, chromeWidth, chromeHeight, 12, theme.surfaceAlt);
    tft.fillCircle(chromeX + 14, chromeY + (chromeHeight / 2), 4, theme.accent);
    tft.setTextDatum(TL_DATUM);
    tft.setTextFont(FONT_LABEL);
    tft.setTextColor(theme.text, theme.surfaceAlt);
    tft.drawString(title, chromeX + 26, chromeY + 5, FONT_LABEL);

    String subtitle = headerSubtitle();
    if (!subtitle.isEmpty()) {
        int chipWidth = min(94, tft.textWidth(subtitle, FONT_INFO) + 16);
        int chipHeight = 18;
        int chipX = chromeX + chromeWidth - chipWidth - 6;
        int chipY = chromeY + 4;

        tft.fillRoundRect(chipX, chipY, chipWidth, chipHeight, chipHeight / 2, theme.background);
        tft.setTextDatum(MC_DATUM);
        tft.setTextFont(FONT_INFO);
        tft.setTextColor(theme.muted, theme.background);
        tft.drawString(subtitle, chipX + (chipWidth / 2), chipY + (chipHeight / 2), FONT_INFO);
    }
}

void drawPlaceholder(const String &title, const String &message) {
    const ThemePalette &theme = activeTheme();
    drawScreenChrome(title);

    drawRoundedPanel(10, 42, 220, 178, theme.surface, theme.surfaceAlt);
    tft.setTextDatum(TC_DATUM);
    tft.fillRoundRect(98, 68, 44, 44, 22, theme.accentSoft);
    tft.setTextColor(theme.accent, theme.accentSoft);
    tft.setTextFont(FONT_TITLE);
    tft.drawString("?", 120, 78, FONT_TITLE);

    tft.setTextColor(theme.text, theme.surface);
    tft.setTextFont(FONT_BODY);
    tft.drawString("Nothing here yet", 120, 128, FONT_BODY);
    drawWrappedCenteredText(message, 120, 154, 184, FONT_INFO, theme.muted, theme.surface, 2);
}

const WeatherData* effectiveWeatherData() {
    return feedsWeatherSource() == WEATHER_FEED_OPEN_METEO ? feedsWeatherData() : nullptr;
}

bool weatherWaitingForSync() {
    return feedsWeatherSource() == WEATHER_FEED_OPEN_METEO &&
           feedsWeatherConfigured() &&
           !feedsHasWeatherData();
}

char weatherUnitSymbol() {
    return feedsWeatherUsesFahrenheit() ? 'F' : 'C';
}

String formatWeatherTemperature(int value) {
    return String(value) + weatherUnitSymbol();
}

const MarketData* effectiveMarketData(uint8_t index) {
    if (index >= DASHBOARD_MARKET_COUNT) {
        return nullptr;
    }

    uint8_t source = feedsMarketSource(index);
    return (source == MARKET_FEED_FINNHUB || source == MARKET_FEED_COINGECKO)
               ? feedsMarketData(index)
               : nullptr;
}

String marketCurrencyPrefix(uint8_t index) {
    if (index >= DASHBOARD_MARKET_COUNT) {
        return "$";
    }

    String currency = safeCString(feedConfig.markets[index].currency);
    currency.trim();
    currency.toLowerCase();
    if (currency.length() == 0) {
        currency = "usd";
    }

    if (currency == "usd") {
        return "$";
    }
    if (currency == "cad") {
        return "CA$";
    }
    if (currency == "aud") {
        return "AU$";
    }
    if (currency == "nzd") {
        return "NZ$";
    }
    if (currency == "sgd") {
        return "SG$";
    }
    if (currency == "hkd") {
        return "HK$";
    }

    currency.toUpperCase();
    return currency + " ";
}

String formatMarketPriceValue(float price) {
    float absolutePrice = price >= 0.0f ? price : -price;
    uint8_t precision = 2;

    if (absolutePrice >= 1000.0f) {
        precision = 0;
    } else if (absolutePrice >= 100.0f) {
        precision = 1;
    } else if (absolutePrice >= 1.0f) {
        precision = 2;
    } else if (absolutePrice >= 0.1f) {
        precision = 3;
    } else {
        precision = 4;
    }

    return groupThousands(trimTrailingZeros(price, precision));
}

String formatMarketPrice(uint8_t index, float price) {
    return marketCurrencyPrefix(index) + formatMarketPriceValue(price);
}

String marketChangeWindowLabel(uint8_t index) {
    return feedsMarketSource(index) == MARKET_FEED_COINGECKO ? "24h" : "1d";
}

String formatMarketChangeSummary(uint8_t index, float changePercent) {
    float absoluteChange = changePercent >= 0.0f ? changePercent : -changePercent;
    uint8_t precision = absoluteChange >= 10.0f ? 1 : 2;
    return marketChangeWindowLabel(index) +
           " " +
           (changePercent >= 0.0f ? "+" : "") +
           trimTrailingZeros(changePercent, precision) +
           "%";
}

bool marketWaitingForSync(uint8_t index) {
    uint8_t source = feedsMarketSource(index);
    return (source == MARKET_FEED_FINNHUB || source == MARKET_FEED_COINGECKO) &&
           feedsMarketConfigured(index) &&
           !feedsHasMarketData(index);
}

bool anyMarketsWaitingForSync() {
    for (uint8_t index = 0; index < DASHBOARD_MARKET_COUNT; ++index) {
        if (marketWaitingForSync(index)) {
            return true;
        }
    }

    return false;
}

String homeAssistantSlotLabel(uint8_t index) {
    if (index >= HOME_ASSISTANT_SLOT_COUNT) {
        return "Entity";
    }

    const HomeAssistantSlotConfig &slot = feedConfig.homeAssistant.slots[index];
    if (slot.label[0] != '\0') {
        return safeCString(slot.label);
    }

    const HomeAssistantSlotData *runtimeSlot = feedsHomeAssistantSlotData(index);
    if (runtimeSlot != nullptr && runtimeSlot->label[0] != '\0') {
        return runtimeSlot->label;
    }

    String entityId = safeCString(slot.entityId);
    int separatorIndex = entityId.lastIndexOf('.');
    if (separatorIndex >= 0 && separatorIndex < static_cast<int>(entityId.length()) - 1) {
        entityId = entityId.substring(separatorIndex + 1);
    }
    entityId.replace("_", " ");
    if (entityId.length() == 0) {
        return "Entity";
    }

    bool capitalizeNext = true;
    for (size_t charIndex = 0; charIndex < entityId.length(); ++charIndex) {
        char character = entityId.charAt(charIndex);
        if (capitalizeNext && character >= 'a' && character <= 'z') {
            entityId.setCharAt(charIndex, static_cast<char>(toupper(character)));
            capitalizeNext = false;
        } else if (character == ' ') {
            capitalizeNext = true;
        } else {
            capitalizeNext = false;
        }
    }

    return entityId;
}

