rpouetpouet/geekmagic-tv-esp8266/src/display.cpp
String homeAssistantSlotUnit(uint8_t index) {
    if (index >= HOME_ASSISTANT_SLOT_COUNT) {
        return "";
    }

    const HomeAssistantSlotConfig &slot = feedConfig.homeAssistant.slots[index];
    if (slot.unit[0] != '\0') {
        return safeCString(slot.unit);
    }

    const HomeAssistantSlotData *runtimeSlot = feedsHomeAssistantSlotData(index);
    return runtimeSlot != nullptr ? safeCString(runtimeSlot->unit) : String("");
}

bool homeAssistantSlotConfigured(uint8_t index) {
    return index < HOME_ASSISTANT_SLOT_COUNT &&
           feedConfig.homeAssistant.slots[index].enabled &&
           feedConfig.homeAssistant.slots[index].entityId[0] != '\0';
}

bool homeAssistantWaitingForSync() {
    return feedsHomeAssistantConfigured() && !feedsHasHomeAssistantData();
}

bool hasWeatherContent() {
    const WeatherData *weather = effectiveWeatherData();
    return weather != nullptr &&
           (weather->location[0] != '\0' ||
            weather->condition[0] != '\0' ||
            feedsHasWeatherData());
}

bool hasFocusContent() {
    return dashboardData.focus.running ||
           dashboardData.focus.breakMode ||
           dashboardData.focus.label[0] != '\0' ||
           dashboardData.focus.remainingSeconds != static_cast<uint32_t>(dashboardData.focus.durationMinutes) * 60UL;
}

const char* activeClockMessage() {
    if (displayState.line2[0] == '\0') {
        return nullptr;
    }

    if (strcmp(displayState.line2, "Dashboard preview ready") == 0) {
        return nullptr;
    }

    return displayState.line2;
}

bool hasMarketContent() {
    for (uint8_t index = 0; index < DASHBOARD_MARKET_COUNT; ++index) {
        const MarketData *market = effectiveMarketData(index);
        if (market != nullptr &&
            market->symbol[0] != '\0' &&
            market->enabled) {
            return true;
        }
    }

    return false;
}

bool hasHomeAssistantContent() {
    if (!feedsHomeAssistantConfigured()) {
        return false;
    }

    for (uint8_t index = 0; index < HOME_ASSISTANT_SLOT_COUNT; ++index) {
        if (homeAssistantSlotConfigured(index)) {
            return true;
        }
    }

    return false;
}

bool hasWorldClockContent() {
    for (uint8_t index = 0; index < DASHBOARD_WORLD_CLOCK_COUNT; ++index) {
        if (dashboardData.worldClocks[index].enabled && dashboardData.worldClocks[index].label[0] != '\0') {
            return true;
        }
    }

    return false;
}

bool hasEventContent() {
    return dashboardData.event.title[0] != '\0' || dashboardData.event.subtitle[0] != '\0' || dashboardData.event.remainingSeconds > 0;
}

bool hasQuoteContent() {
    return dashboardData.quote.text[0] != '\0';
}

bool hasStatusContent() {
    return dashboardData.status.line1[0] != '\0' || dashboardData.status.line2[0] != '\0';
}

bool dashboardPageHasRenderableContent(uint8_t pageId) {
    switch (pageId) {
        case DASHBOARD_PAGE_CLOCK:
            return true;
        case DASHBOARD_PAGE_WEATHER:
            return hasWeatherContent() || weatherWaitingForSync();
        case DASHBOARD_PAGE_MARKETS:
            return hasMarketContent() || anyMarketsWaitingForSync();
        case DASHBOARD_PAGE_HOME:
            return hasHomeAssistantContent() || homeAssistantWaitingForSync();
        case DASHBOARD_PAGE_FOCUS:
            return hasFocusContent();
        case DASHBOARD_PAGE_WORLD:
            return hasWorldClockContent();
        case DASHBOARD_PAGE_EVENT:
            return hasEventContent();
        case DASHBOARD_PAGE_QUOTE:
            return hasQuoteContent();
        case DASHBOARD_PAGE_STATUS:
            return hasStatusContent();
        default:
            return false;
    }
}

bool dashboardPageAvailable(uint8_t pageId) {
    return dashboardPageEnabled(pageId) && dashboardPageHasRenderableContent(pageId);
}

uint8_t firstAvailableDashboardPage() {
    for (uint8_t pageId = 0; pageId < DASHBOARD_PAGE_COUNT; ++pageId) {
        if (dashboardPageAvailable(pageId)) {
            return pageId;
        }
    }

    return dashboardFirstEnabledPage();
}

uint8_t nextAvailableDashboardPage(uint8_t currentPage) {
    for (uint8_t offset = 1; offset <= DASHBOARD_PAGE_COUNT; ++offset) {
        uint8_t pageId = (currentPage + offset) % DASHBOARD_PAGE_COUNT;
        if (dashboardPageAvailable(pageId)) {
            return pageId;
        }
    }

    if (dashboardPageEnabled(currentPage)) {
        return currentPage;
    }

    return dashboardFirstEnabledPage();
}

void hashWeatherData(uint32_t &hash) {
    hashValue(hash, feedsWeatherSource());
    hashValue(hash, feedsWeatherUsesFahrenheit());
    hashValue(hash, weatherWaitingForSync());

    const WeatherData *weather = effectiveWeatherData();
    bool hasData = weather != nullptr;
    hashValue(hash, hasData);
    if (!hasData) {
        return;
    }

    hashCString(hash, weather->location);
    hashCString(hash, weather->condition);
    hashValue(hash, weather->temperature);
    hashValue(hash, weather->high);
    hashValue(hash, weather->low);
    hashValue(hash, weather->rainChance);
}

void hashMarketData(uint32_t &hash) {
    for (uint8_t index = 0; index < DASHBOARD_MARKET_COUNT; ++index) {
        hashValue(hash, feedsMarketSource(index));
        hashValue(hash, marketWaitingForSync(index));
        hashCString(hash, feedConfig.markets[index].currency);

        const MarketData *market = effectiveMarketData(index);
        bool hasData = market != nullptr;
        hashValue(hash, hasData);
        if (!hasData) {
            continue;
        }

        hashValue(hash, market->enabled);
        hashCString(hash, market->symbol);
        hashCString(hash, market->label);
        hashValue(hash, market->price);
        hashValue(hash, market->change);
        hashValue(hash, market->changePercent);
    }
}

void hashHomeAssistantData(uint32_t &hash) {
    hashValue(hash, feedsHomeAssistantConfigured());
    hashValue(hash, feedsHasHomeAssistantData());
    hashValue(hash, homeAssistantWaitingForSync());
    hashCString(hash, feedConfig.homeAssistant.baseUrl);
    hashValue(hash, feedConfig.homeAssistant.refreshMinutes);

    for (uint8_t index = 0; index < HOME_ASSISTANT_SLOT_COUNT; ++index) {
        const HomeAssistantSlotConfig &slotConfig = feedConfig.homeAssistant.slots[index];
        hashValue(hash, slotConfig.enabled);
        hashCString(hash, slotConfig.entityId);
        hashCString(hash, slotConfig.label);
        hashCString(hash, slotConfig.unit);

        const HomeAssistantSlotData *slot = feedsHomeAssistantSlotData(index);
        bool hasData = slot != nullptr;
        hashValue(hash, hasData);
        if (!hasData) {
            continue;
        }

        hashValue(hash, slot->numeric);
        hashCString(hash, slot->label);
        hashCString(hash, slot->state);
        hashCString(hash, slot->unit);
    }
}

void hashWorldClockData(uint32_t &hash) {
    for (uint8_t index = 0; index < DASHBOARD_WORLD_CLOCK_COUNT; ++index) {
        const WorldClockData &clock = dashboardData.worldClocks[index];
        hashValue(hash, clock.enabled);
        hashCString(hash, clock.label);
        hashValue(hash, clock.offsetSeconds);
    }
}

void hashCommonPageState(uint32_t &hash, uint8_t pageId) {
    hashValue(hash, pageId);
    hashThemeConfig(hash);
    hashValue(hash, dashboardConfig.showIp);
    hashCString(hash, displayState.ipInfo);
}

uint32_t dashboardStaticHash(uint8_t pageId) {
    uint32_t hash = kFnvOffset;
    hashCommonPageState(hash, pageId);

    switch (pageId) {
        case DASHBOARD_PAGE_CLOCK:
            hashValue(hash, dashboardConfig.use24Hour);
            hashValue(hash, dashboardConfig.showSeconds);
            hashValue(hash, hasWeatherContent());
            hashValue(hash, weatherWaitingForSync());
            hashValue(hash, activeClockMessage() != nullptr);
            if (hasWeatherContent()) {
                hashWeatherData(hash);
            } else if (activeClockMessage() != nullptr) {
                hashCString(hash, activeClockMessage());
            }
            break;
        case DASHBOARD_PAGE_WEATHER:
            hashWeatherData(hash);
            break;
        case DASHBOARD_PAGE_MARKETS:
            hashMarketData(hash);
            break;
        case DASHBOARD_PAGE_HOME:
            hashHomeAssistantData(hash);
            break;
        case DASHBOARD_PAGE_FOCUS:
            hashCString(hash, dashboardData.focus.label);
            hashValue(hash, dashboardData.focus.running);
            hashValue(hash, dashboardData.focus.breakMode);
            hashValue(hash, dashboardData.focus.durationMinutes);
            break;
        case DASHBOARD_PAGE_WORLD:
            hashValue(hash, dashboardConfig.use24Hour);
            hashWorldClockData(hash);
            break;
        case DASHBOARD_PAGE_EVENT:
            hashCString(hash, dashboardData.event.title);
            hashCString(hash, dashboardData.event.subtitle);
            break;
        case DASHBOARD_PAGE_QUOTE:
            hashCString(hash, dashboardData.quote.text);
            hashCString(hash, dashboardData.quote.author);
            break;
        case DASHBOARD_PAGE_STATUS:
            hashCString(hash, dashboardData.status.line1);
            hashCString(hash, dashboardData.status.line2);
            break;
        default:
            break;
    }

    return hash;
}

uint32_t dashboardDynamicHash(uint8_t pageId) {
    uint32_t hash = kFnvOffset;
    hashValue(hash, pageId);

    switch (pageId) {
        case DASHBOARD_PAGE_CLOCK: {
            bool isPm = false;
            String timeText = formatLocalTime(dashboardConfig.showSeconds, dashboardConfig.use24Hour, &isPm);
            String metaLine = formatClockMetaLine(isPm);
            hashCString(hash, timeText.c_str());
            hashCString(hash, metaLine.c_str());
            hashValue(hash, isPm);
            break;
        }
        case DASHBOARD_PAGE_FOCUS: {
            int32_t remainingSeconds = dashboardFocusRemainingSeconds();
            hashValue(hash, remainingSeconds);
            break;
        }
        case DASHBOARD_PAGE_WORLD: {
            for (uint8_t index = 0; index < DASHBOARD_WORLD_CLOCK_COUNT; ++index) {
                const WorldClockData &clock = dashboardData.worldClocks[index];
                if (!clock.enabled || clock.label[0] == '\0') {
                    continue;
                }

                String timeText = formatWorldTime(clock.offsetSeconds);
                hashCString(hash, timeText.c_str());
            }
            break;
        }
        case DASHBOARD_PAGE_EVENT: {
            String countdown = formatRelativeCountdown(dashboardEventRemainingSeconds());
            hashCString(hash, countdown.c_str());
            break;
        }
        default:
            break;
    }

    return hash;
}

uint32_t apScreenHash() {
    uint32_t hash = kFnvOffset;
    hashThemeConfig(hash);
    hashCString(hash, displayState.ipInfo);
    hashCString(hash, displayState.apSSID);
    hashCString(hash, displayState.apPassword);
    hashValue(hash, authCanRevealPassword());
    hashCString(hash, authProvisionedPassword());
    return hash;
}

