rpouetpouet/geekmagic-tv-esp8266/src/display.cpp
uint32_t temporaryMessageHash() {
    uint32_t hash = kFnvOffset;
    hashThemeConfig(hash);
    hashValue(hash, displayState.apMode);
    hashValue(hash, dashboardConfig.showIp);
    hashCString(hash, displayState.ipInfo);
    hashCString(hash, temporaryMessage.message);
    return hash;
}

bool pageUsesDynamicRefresh(uint8_t pageId) {
    return pageId == DASHBOARD_PAGE_CLOCK ||
           pageId == DASHBOARD_PAGE_FOCUS ||
           pageId == DASHBOARD_PAGE_WORLD ||
           pageId == DASHBOARD_PAGE_EVENT;
}

bool ensureClockDynamicSprite() {
    if (!clockDynamicSpriteAllowed) {
        return false;
    }

    if (clockDynamicSpriteReady) {
        return true;
    }

    if (clockDynamicSpriteAttempted) {
        return false;
    }

    clockDynamicSpriteAttempted = true;
    uint32_t freeHeap = ESP.getFreeHeap();
    if (freeHeap < kClockSpriteMinFreeHeapBytes) {
        logPrintf("Clock sprite skipped, free heap too low: %u", freeHeap);
        return false;
    }

    clockDynamicSprite.deleteSprite();
    clockDynamicSprite.setColorDepth(4);
    clockDynamicSpriteReady =
        clockDynamicSprite.createSprite(kClockDynamicRegionWidth, kClockDynamicRegionHeight) != nullptr;

    if (clockDynamicSpriteReady) {
        logPrintf("Clock sprite ready (%dx%d), free heap now %u",
                  kClockDynamicRegionWidth,
                  kClockDynamicRegionHeight,
                  ESP.getFreeHeap());
    } else {
        logPrintf("Clock sprite allocation failed, free heap was %u", freeHeap);
    }

    return clockDynamicSpriteReady;
}

void updateClockDynamicArea() {
    const ThemePalette &theme = activeTheme();
    bool isPm = false;
    String timeText = formatLocalTime(dashboardConfig.showSeconds, dashboardConfig.use24Hour, &isPm);
    String metaLine = formatClockMetaLine(isPm);
    uint16_t dynamicBackground = theme.surface;
    int localTimeTopY = kClockTimeY - kClockDynamicRegionY;

    if (ensureClockDynamicSprite()) {
        clockDynamicSprite.fillSprite(dynamicBackground);
        drawClockTime(clockDynamicSprite,
                      timeText,
                      dashboardConfig.showSeconds,
                      theme.text,
                      theme.muted,
                      dynamicBackground,
                      kClockDynamicRegionWidth / 2,
                      localTimeTopY);
        clockDynamicSprite.pushSprite(kClockDynamicRegionX, kClockDynamicRegionY);
    } else {
        tft.fillRect(kClockDynamicRegionX,
                     kClockDynamicRegionY,
                     kClockDynamicRegionWidth,
                     kClockDynamicRegionHeight,
                     dynamicBackground);
        drawClockTime(tft,
                      timeText,
                      dashboardConfig.showSeconds,
                      theme.text,
                      theme.muted,
                      dynamicBackground,
                      120,
                      kClockTimeY);
    }

    if (!clockMetaCache.valid || strcmp(clockMetaCache.metaLine, metaLine.c_str()) != 0) {
        tft.setTextFont(FONT_BODY);
        int metaWidth = tft.textWidth(metaLine) + 12;
        if (clockMetaCache.valid) {
            metaWidth = max(metaWidth, tft.textWidth(clockMetaCache.metaLine) + 12);
        }

        tft.setTextDatum(TC_DATUM);
        tft.setTextColor(theme.muted, dynamicBackground);
        tft.setTextPadding(metaWidth);
        tft.drawString(metaLine, 120, kClockMetaY, FONT_BODY);
        tft.setTextPadding(0);
        updateClockMetaCache(metaLine);
    }
}

void updateFocusDynamicArea() {
    const ThemePalette &theme = activeTheme();
    int32_t remainingSeconds = dashboardFocusRemainingSeconds();

    tft.fillRect(20, 92, 200, 112, theme.surface);
    tft.setTextDatum(TC_DATUM);
    tft.setTextFont(FONT_HUGE);
    tft.setTextColor(theme.text, theme.surface);
    tft.drawString(formatDuration(remainingSeconds), 120, 106, FONT_HUGE);

    int progressWidth = 184;
    int progressHeight = 8;
    int progressX = 28;
    int progressY = 178;
    tft.fillRoundRect(progressX, progressY, progressWidth, progressHeight, 4, theme.surfaceAlt);
    if (dashboardData.focus.durationMinutes > 0) {
        uint32_t totalSeconds = static_cast<uint32_t>(dashboardData.focus.durationMinutes) * 60UL;
        uint32_t boundedRemaining = remainingSeconds > 0 ? static_cast<uint32_t>(remainingSeconds) : 0U;
        uint32_t elapsedSeconds = (boundedRemaining < totalSeconds) ? (totalSeconds - boundedRemaining) : totalSeconds;
        uint32_t safeTotal = totalSeconds > 0 ? totalSeconds : 1U;
        int filledWidth = map(elapsedSeconds, 0, safeTotal, 0, progressWidth);
        filledWidth = constrain(filledWidth, 0, progressWidth);
        if (filledWidth > 0) {
            tft.fillRoundRect(progressX, progressY, filledWidth, progressHeight, 4, theme.accent);
        }
    }

    tft.setTextFont(FONT_INFO);
    tft.setTextColor(theme.muted, theme.surface);
    tft.drawString("Duration " + String(dashboardData.focus.durationMinutes) + " min", 120, 196, FONT_INFO);
}

void updateWorldDynamicArea() {
    const ThemePalette &theme = activeTheme();
    int y = 70;
    for (uint8_t clockIndex = 0; clockIndex < DASHBOARD_WORLD_CLOCK_COUNT; ++clockIndex) {
        const WorldClockData &clock = dashboardData.worldClocks[clockIndex];
        if (!clock.enabled || clock.label[0] == '\0') {
            continue;
        }

        tft.fillRect(20, y, 118, 26, theme.surface);
        tft.setTextDatum(TL_DATUM);
        tft.setTextFont(FONT_TITLE);
        tft.setTextColor(theme.text, theme.surface);
        tft.drawString(formatWorldTime(clock.offsetSeconds), 20, y, FONT_TITLE);
        y += 72;
    }
}

void updateEventDynamicArea() {
    const ThemePalette &theme = activeTheme();
    tft.fillRect(20, 96, 200, 52, theme.surface);
    tft.setTextDatum(TC_DATUM);
    tft.setTextFont(FONT_HUGE);
    tft.setTextColor(theme.accent, theme.surface);
    tft.drawString(formatRelativeCountdown(dashboardEventRemainingSeconds()), 120, 100, FONT_HUGE);
}

void renderClockPage() {
    const ThemePalette &theme = activeTheme();
    const int compactFonts[] = {FONT_BODY, FONT_LABEL, FONT_INFO};
    const int footerConditionFonts[] = {FONT_LABEL, FONT_INFO};
    const int footerTemperatureFonts[] = {FONT_BODY, FONT_LABEL, FONT_INFO};
    drawScreenChrome("Clock");
    drawRoundedPanel(8, 40, 224, 106, theme.surface, theme.surfaceAlt);
    clockMetaCache.valid = false;
    updateClockDynamicArea();

