rpouetpouet/geekmagic-tv-esp8266/src/display.cpp
    const char *clockMessage = activeClockMessage();
    bool showBottomPanel = hasWeatherContent() || weatherWaitingForSync() || clockMessage != nullptr;
    if (!showBottomPanel) {
        return;
    }

    drawRoundedPanel(8, 152, 224, 82, theme.surfaceAlt, theme.surfaceAlt);
    if (hasWeatherContent()) {
        const WeatherData *weather = effectiveWeatherData();
        int footerLeft = 18;
        tft.setTextDatum(TL_DATUM);
        tft.setTextFont(FONT_INFO);
        tft.setTextColor(theme.muted, theme.surfaceAlt);
        String location = (weather != nullptr && weather->location[0] != '\0') ? weather->location : "Weather";
        tft.drawString(location, footerLeft, 164, FONT_INFO);

        drawAdaptiveBadge(158,
                          158,
                          62,
                          26,
                          formatWeatherTemperature(weather->temperature),
                          footerTemperatureFonts,
                          sizeof(footerTemperatureFonts) / sizeof(footerTemperatureFonts[0]),
                          theme.accentSoft,
                          theme.accent,
                          1);

        tft.setTextColor(theme.text, theme.surfaceAlt);
        String condition = weather->condition[0] != '\0' ? weather->condition : "Ready";
        drawAdaptiveText(condition,
                         footerLeft,
                         192,
                         132,
                         TL_DATUM,
                         footerConditionFonts,
                         sizeof(footerConditionFonts) / sizeof(footerConditionFonts[0]),
                         theme.text,
                         theme.surfaceAlt);

        tft.setTextFont(FONT_INFO);
        tft.setTextColor(theme.muted, theme.surfaceAlt);
        String summary = "H " + formatWeatherTemperature(weather->high) +
                         "  L " + formatWeatherTemperature(weather->low) +
                         "  Rain " + String(weather->rainChance) + "%";
        drawAdaptiveText(summary,
                         footerLeft,
                         210,
                         188,
                         TL_DATUM,
                         compactFonts,
                         sizeof(compactFonts) / sizeof(compactFonts[0]),
                         theme.muted,
                         theme.surfaceAlt);
    } else if (weatherWaitingForSync()) {
        drawWrappedCenteredText("Syncing weather...", 120, 182, 192, FONT_INFO, theme.muted, theme.surfaceAlt, 2);
    } else if (clockMessage != nullptr) {
        drawWrappedCenteredText(clockMessage, 120, 178, 192, FONT_LABEL, theme.text, theme.surfaceAlt, 2);
    }
}

void renderWeatherPage() {
    const ThemePalette &theme = activeTheme();
    if (!hasWeatherContent()) {
        if (weatherWaitingForSync()) {
            drawPlaceholder("Weather", "Syncing live data.");
            return;
        }
        drawPlaceholder("Weather", "Add weather data.");
        return;
    }

    const WeatherData *weather = effectiveWeatherData();
    const int heroFonts[] = {FONT_HUGE, FONT_TITLE, FONT_BODY};
    const int compactFonts[] = {FONT_BODY, FONT_LABEL, FONT_INFO};
    drawScreenChrome("Weather");
    drawRoundedPanel(8, 42, 224, 120, theme.surface, theme.surfaceAlt);

    tft.setTextDatum(TC_DATUM);
    tft.setTextFont(FONT_INFO);
    tft.setTextColor(theme.muted, theme.surface);
    tft.drawString(weather->location[0] != '\0' ? weather->location : "Weather",
                   120, 52, FONT_INFO);

    drawAdaptiveText(formatWeatherTemperature(weather->temperature),
                     120,
                     78,
                     180,
                     TC_DATUM,
                     heroFonts,
                     sizeof(heroFonts) / sizeof(heroFonts[0]),
                     theme.text,
                     theme.surface);

    drawAdaptiveText(weather->condition[0] != '\0' ? weather->condition : "Updated",
                     120,
                     134,
                     180,
                     TC_DATUM,
                     compactFonts,
                     sizeof(compactFonts) / sizeof(compactFonts[0]),
                     theme.accent,
                     theme.surface);

    drawRoundedPanel(8, 168, 224, 62, theme.surfaceAlt, theme.surfaceAlt);
    drawDividerColumn(82, 184, 40, theme.background);
    drawDividerColumn(156, 184, 40, theme.background);
    drawMetricColumn(45, 186, "High", formatWeatherTemperature(weather->high), theme.muted, theme.text, theme.surfaceAlt);
    drawMetricColumn(119, 186, "Low", formatWeatherTemperature(weather->low), theme.muted, theme.text, theme.surfaceAlt);
    drawMetricColumn(193, 186, "Rain", String(weather->rainChance) + "%", theme.muted, theme.text, theme.surfaceAlt);
}

void renderMarketsPage() {
    const ThemePalette &theme = activeTheme();
    if (!hasMarketContent()) {
        if (anyMarketsWaitingForSync()) {
            drawPlaceholder("Markets", "Syncing live data.");
            return;
        }
        drawPlaceholder("Markets", "Add ticker data.");
        return;
    }

    drawScreenChrome("Markets");
    drawRoundedPanel(8, 42, 224, 184, theme.surface, theme.surfaceAlt);

    int y = 50;
    bool firstRow = true;
    const int standardPriceFonts[] = {FONT_TITLE, FONT_BODY, FONT_LABEL};
    const int compactPriceFonts[] = {FONT_BODY, FONT_LABEL, FONT_INFO};
    const int symbolFonts[] = {FONT_BODY, FONT_LABEL};
    const int labelFonts[] = {FONT_BODY, FONT_LABEL, FONT_INFO};
    const int deltaFonts[] = {FONT_INFO};
    for (uint8_t marketIndex = 0; marketIndex < DASHBOARD_MARKET_COUNT; ++marketIndex) {
        const MarketData *market = effectiveMarketData(marketIndex);
        if (market == nullptr ||
            market->symbol[0] == '\0' ||
            !market->enabled) {
            continue;
        }

        if (!firstRow) {
            drawDividerLine(20, y - 8, 192, theme.surfaceAlt);
        }

        tft.setTextDatum(TL_DATUM);
        String marketLabel = market->label[0] != '\0' ? market->label : "Live feed";
        drawAdaptiveText(market->symbol,
                         20,
                         y,
                         72,
                         TL_DATUM,
                         symbolFonts,
                         sizeof(symbolFonts) / sizeof(symbolFonts[0]),
                         theme.accent,
                         theme.surface);
        drawAdaptiveText(marketLabel,
                         20,
                         y + 20,
                         104,
                         TL_DATUM,
                         labelFonts,
                         sizeof(labelFonts) / sizeof(labelFonts[0]),
                         theme.text,
                         theme.surface);

        tft.setTextDatum(TR_DATUM);
        String priceText = formatMarketPrice(marketIndex, market->price);
        const int *priceFonts = standardPriceFonts;
        size_t priceFontCount = sizeof(standardPriceFonts) / sizeof(standardPriceFonts[0]);
        if (priceText.length() >= 8 || tft.textWidth(priceText, FONT_TITLE) > 126) {
            priceFonts = compactPriceFonts;
            priceFontCount = sizeof(compactPriceFonts) / sizeof(compactPriceFonts[0]);
        }

        int priceFont = chooseFittingFont(priceText, 134, priceFonts, priceFontCount);
        tft.setTextFont(priceFont);
        tft.setTextColor(theme.text, theme.surface);
        tft.drawString(priceText, 220, y + 2, priceFont);

        int deltaY = y + 2 + tft.fontHeight() + 4;

        uint16_t deltaColor = market->changePercent >= 0.0f ? theme.positive : theme.negative;
        drawAdaptiveText(formatMarketChangeSummary(marketIndex, market->changePercent),
                         220,
                         deltaY,
                         134,
                         TR_DATUM,
                         deltaFonts,
                         sizeof(deltaFonts) / sizeof(deltaFonts[0]),
                         deltaColor,
                         theme.surface);

        y += 58;
        firstRow = false;
    }
}

void drawGauge(int x, int y, int width, int height, float progress,
               uint16_t fillColor, uint16_t bgColor, uint16_t borderColor) {
    (void)borderColor;
    float clampedProgress = constrain(progress, 0.0f, 1.0f);
    tft.fillRoundRect(x, y, width, height, height / 2, bgColor);
    int fillWidth = static_cast<int>((width - 2) * clampedProgress);
    if (fillWidth > 0) {
        tft.fillRoundRect(x + 1, y + 1, fillWidth, height - 2, (height - 2) / 2, fillColor);
    }
}

void drawHomeAssistantCard(int x,
                           int y,
                           int width,
                           int height,
                           uint8_t slotIndex,
                           uint16_t fillColor,
                           uint16_t borderColor) {
    const ThemePalette &theme = activeTheme();
    drawRoundedPanel(x, y, width, height, fillColor, borderColor);

    tft.fillRoundRect(x + 10, y + 10, 26, 4, 2, theme.accentSoft);

    const int labelFonts[] = {FONT_LABEL, FONT_INFO};
    const int valueFonts[] = {FONT_BODY, FONT_LABEL, FONT_INFO};
    const int unitFonts[] = {FONT_INFO};
    const HomeAssistantSlotData *slot = feedsHomeAssistantSlotData(slotIndex);
    int labelY = y + 18;
    int stateY = height >= 120 ? y + 74 : (height >= 96 ? y + 50 : y + 40);
    int unitY = height >= 120 ? y + 106 : (height >= 96 ? y + 76 : y + 61);

    String label = homeAssistantSlotLabel(slotIndex);
    drawAdaptiveText(label,
                     x + 12,
                     labelY,
                     width - 24,
                     TL_DATUM,
                     labelFonts,
                     sizeof(labelFonts) / sizeof(labelFonts[0]),
                     theme.muted,
                     fillColor);

