rpouetpouet/geekmagic-tv-esp8266/src/display.cpp
    String unit = homeAssistantSlotUnit(slotIndex);
    if (slot != nullptr && slot->hasData && unit.length() > 0) {
        drawAdaptiveBadge(x + width - 52,
                          y + 10,
                          40,
                          18,
                          unit,
                          unitFonts,
                          sizeof(unitFonts) / sizeof(unitFonts[0]),
                          theme.accentSoft,
                          theme.accent);
    }

    String stateText = "Waiting";
    uint16_t stateColor = theme.text;
    if (slot != nullptr && slot->hasData) {
        stateText = safeCString(slot->state);
        stateColor = slot->numeric ? theme.text : theme.accent;
    } else if (!feedsHomeAssistantConfigured()) {
        stateText = "Add";
        stateColor = theme.muted;
    } else if (!homeAssistantSlotConfigured(slotIndex)) {
        stateText = "Off";
        stateColor = theme.muted;
    } else if (!homeAssistantWaitingForSync()) {
        stateText = "No data";
        stateColor = theme.muted;
    }

    uint8_t dispMode = feedConfig.homeAssistant.slots[slotIndex].displayMode;
    bool useGauge = (dispMode == 1 && slot != nullptr && slot->hasData && slot->numeric);

    if (useGauge) {
        // Draw gauge bar (10px below original stateY)
        int gaugeX = x + 12;
        int gaugeWidth = width - 24;
        int gaugeHeight = 16;
        int gaugeY = stateY - (gaugeHeight / 2) + 10;
        float gaugeProgress = (slot->gaugeMax > 0.0f) ? slot->gaugeValue / slot->gaugeMax : 0.0f;
        drawGauge(gaugeX, gaugeY, gaugeWidth, gaugeHeight, gaugeProgress,
                  theme.accent, theme.surface, theme.surfaceAlt);
        // Draw value text centered over the gauge
        tft.setTextDatum(TC_DATUM);
        tft.setTextColor(TFT_WHITE, theme.accent);
        tft.drawString(stateText, x + (width / 2), gaugeY + (gaugeHeight / 2) - 1, FONT_LABEL);
    } else {
        drawAdaptiveText(stateText,
                         x + (width / 2),
                         stateY - 30,
                         width - 20,
                         TC_DATUM,
                         valueFonts,
                         sizeof(valueFonts) / sizeof(valueFonts[0]),
                         stateColor,
                         fillColor);
    }

    if (slot != nullptr &&
        slot->hasData &&
        unit.length() > 0 &&
        (!slot->numeric || tft.textWidth(stateText, FONT_TITLE) > width - 30)) {
        if (!useGauge) {
            drawAdaptiveText(unit,
                             x + (width / 2),
                             unitY,
                             width - 22,
                             TC_DATUM,
                             unitFonts,
                             sizeof(unitFonts) / sizeof(unitFonts[0]),
                             theme.muted,
                             fillColor);
        }
    }
}

void renderHomePage() {
    const ThemePalette &theme = activeTheme();
    if (!hasHomeAssistantContent()) {
        if (homeAssistantWaitingForSync()) {
            drawPlaceholder("Home", "Syncing Home Assistant.");
            return;
        }
        drawPlaceholder("Home", "Add Home Assistant entities.");
        return;
    }

    drawScreenChrome("Home");
    drawRoundedPanel(8, 42, 224, 184, theme.surface, theme.surfaceAlt);

    uint8_t slotIndexes[HOME_ASSISTANT_SLOT_COUNT] = {0};
    uint8_t slotCount = 0;
    for (uint8_t index = 0; index < HOME_ASSISTANT_SLOT_COUNT; ++index) {
        if (homeAssistantSlotConfigured(index)) {
            slotIndexes[slotCount++] = index;
        }
    }

    if (slotCount == 0) {
        drawWrappedCenteredText("Add Home Assistant entities.", 120, 114, 188, FONT_LABEL, theme.muted, theme.surface, 2);
        return;
    }

    if (slotCount == 1) {
        drawHomeAssistantCard(16, 48, 208, 160, slotIndexes[0], theme.surfaceAlt, theme.surfaceAlt);
        return;
    }

    if (slotCount == 2) {
        drawHomeAssistantCard(16, 48, 208, 70, slotIndexes[0], theme.surfaceAlt, theme.surfaceAlt);
        drawHomeAssistantCard(16, 134, 208, 70, slotIndexes[1], theme.surfaceAlt, theme.surfaceAlt);
        return;
    }

    const int cardWidth = 100;
    const int cardHeight = 80;
    const int leftColumnX = 16;
    const int rightColumnX = 124;
    const int topRowY = 48;
    const int bottomRowY = 136;

    for (uint8_t displayIndex = 0; displayIndex < slotCount; ++displayIndex) {
        int x = (displayIndex % 2 == 0) ? leftColumnX : rightColumnX;
        int y = (displayIndex < 2) ? topRowY : bottomRowY;
        drawHomeAssistantCard(x,
                              y,
                              cardWidth,
                              cardHeight,
                              slotIndexes[displayIndex],
                              theme.surfaceAlt,
                              theme.surfaceAlt);
    }
}

void renderFocusPage() {
    if (!hasFocusContent()) {
        drawPlaceholder("Focus", "Set a timer when you need it.");
        return;
    }

    const ThemePalette &theme = activeTheme();
    drawScreenChrome("Focus");

    drawRoundedPanel(8, 42, 224, 184, theme.surface, theme.surfaceAlt);
    drawBadge(18, 48, 64, 20, dashboardData.focus.breakMode ? "Break" : "Focus", theme.accentSoft, theme.accent);

    if (dashboardData.focus.running) {
        drawBadge(166, 48, 54, 20, "Active", theme.positive, theme.background);
    } else {
        drawBadge(170, 48, 50, 20, "Ready", theme.surfaceAlt, theme.text);
    }

    tft.setTextDatum(TC_DATUM);
    tft.setTextFont(FONT_INFO);
    tft.setTextColor(theme.muted, theme.surface);
    tft.drawString(dashboardData.focus.label[0] != '\0' ? dashboardData.focus.label : "Session",
                   120, 76, FONT_INFO);

    updateFocusDynamicArea();
}

void renderWorldPage() {
    const ThemePalette &theme = activeTheme();
    if (!hasWorldClockContent()) {
        drawPlaceholder("World", "Add world clocks.");
        return;
    }

    drawScreenChrome("World");
    drawRoundedPanel(8, 42, 224, 184, theme.surface, theme.surfaceAlt);

