rpouetpouet/geekmagic-tv-esp8266/src/display.cpp
    int y = 52;
    bool firstRow = true;
    const int offsetFonts[] = {FONT_INFO};
    for (uint8_t clockIndex = 0; clockIndex < DASHBOARD_WORLD_CLOCK_COUNT; ++clockIndex) {
        const WorldClockData &clock = dashboardData.worldClocks[clockIndex];
        if (!clock.enabled || clock.label[0] == '\0') {
            continue;
        }

        if (!firstRow) {
            drawDividerLine(20, y - 10, 184, theme.surfaceAlt);
        }

        tft.setTextDatum(TL_DATUM);
        tft.setTextFont(FONT_INFO);
        tft.setTextColor(theme.muted, theme.surface);
        tft.drawString(clock.label, 20, y, FONT_INFO);

        drawAdaptiveText(formatUtcOffset(clock.offsetSeconds),
                         220,
                         y,
                         88,
                         TR_DATUM,
                         offsetFonts,
                         sizeof(offsetFonts) / sizeof(offsetFonts[0]),
                         theme.accent,
                         theme.surface);
        y += 72;
        firstRow = false;
    }

    updateWorldDynamicArea();
}

void renderEventPage() {
    const ThemePalette &theme = activeTheme();
    if (!hasEventContent()) {
        drawPlaceholder("Event", "Add a countdown.");
        return;
    }

    drawScreenChrome("Event");
    drawRoundedPanel(8, 42, 224, 184, theme.surface, theme.surfaceAlt);

    drawWrappedCenteredText(dashboardData.event.title[0] != '\0' ? dashboardData.event.title : "Upcoming",
                            120, 56, 186, FONT_BODY, theme.text, theme.surface, 2);
    tft.fillRoundRect(104, 82, 32, 4, 2, theme.accentSoft);

    updateEventDynamicArea();

    if (dashboardData.event.subtitle[0] != '\0') {
        drawWrappedCenteredText(dashboardData.event.subtitle,
                                120,
                                178,
                                184,
                                FONT_INFO,
                                theme.muted,
                                theme.surface,
                                2);
    }
}

void renderQuotePage() {
    const ThemePalette &theme = activeTheme();
    if (!hasQuoteContent()) {
        drawPlaceholder("Quote", "Add a quote.");
        return;
    }

    drawScreenChrome("Quote");
    drawRoundedPanel(8, 42, 224, 184, theme.surface, theme.surfaceAlt);

    tft.setTextDatum(TC_DATUM);
    tft.fillRoundRect(100, 52, 40, 40, 20, theme.accentSoft);
    tft.setTextFont(FONT_TITLE);
    tft.setTextColor(theme.accent, theme.accentSoft);
    tft.drawString("\"", 120, 60, FONT_TITLE);

    drawWrappedCenteredText(safeCString(dashboardData.quote.text),
                            120, 104, 186, FONT_LABEL, theme.text, theme.surface, 4);

    if (dashboardData.quote.author[0] != '\0') {
        int chipWidth = min(160, tft.textWidth(dashboardData.quote.author, FONT_INFO) + 20);
        int chipX = 120 - (chipWidth / 2);
        tft.fillRoundRect(chipX, 186, chipWidth, 20, 10, theme.accentSoft);
        drawAdaptiveText(safeCString(dashboardData.quote.author),
                         120,
                         191,
                         chipWidth - 14,
                         MC_DATUM,
                         nullptr,
                         0,
                         theme.accent,
                         theme.accentSoft);
    }
}

void renderStatusPage() {
    const ThemePalette &theme = activeTheme();
    if (!hasStatusContent()) {
        drawPlaceholder("Status", "Add status lines.");
        return;
    }

    drawScreenChrome("Status");

    drawRoundedPanel(8, 42, 224, 184, theme.surface, theme.surfaceAlt);
    tft.setTextDatum(TC_DATUM);
    tft.setTextFont(FONT_TITLE);
    tft.setTextColor(theme.text, theme.surface);
    drawWrappedCenteredText(dashboardData.status.line1[0] != '\0' ? dashboardData.status.line1 : "Status line 1",
                            120, 74, 184, FONT_BODY, theme.text, theme.surface, 2);

    drawDividerLine(28, 132, 184, theme.surfaceAlt);
    drawWrappedCenteredText(dashboardData.status.line2[0] != '\0' ? dashboardData.status.line2 : "Status line 2",
                            120, 150, 184, FONT_LABEL, theme.muted, theme.surface, 2);
}

void renderDashboardPage() {
    if (!dashboardPageAvailable(displayState.currentPage)) {
        displayState.currentPage = firstAvailableDashboardPage();
    }

    switch (displayState.currentPage) {
        case DASHBOARD_PAGE_CLOCK:
            renderClockPage();
            break;
        case DASHBOARD_PAGE_WEATHER:
            renderWeatherPage();
            break;
        case DASHBOARD_PAGE_MARKETS:
            renderMarketsPage();
            break;
        case DASHBOARD_PAGE_HOME:
            renderHomePage();
            break;
        case DASHBOARD_PAGE_FOCUS:
            renderFocusPage();
            break;
        case DASHBOARD_PAGE_WORLD:
            renderWorldPage();
            break;
        case DASHBOARD_PAGE_EVENT:
            renderEventPage();
            break;
        case DASHBOARD_PAGE_QUOTE:
            renderQuotePage();
            break;
        case DASHBOARD_PAGE_STATUS:
            renderStatusPage();
            break;
        default:
            renderClockPage();
            break;
    }
}

void updateDashboardDynamicArea(uint8_t pageId) {
    switch (pageId) {
        case DASHBOARD_PAGE_CLOCK:
            updateClockDynamicArea();
            break;
        case DASHBOARD_PAGE_FOCUS:
            updateFocusDynamicArea();
            break;
        case DASHBOARD_PAGE_WORLD:
            updateWorldDynamicArea();
            break;
        case DASHBOARD_PAGE_EVENT:
            updateEventDynamicArea();
            break;
        default:
            break;
    }
}

void renderDashboardPageCached() {
    if (!dashboardPageAvailable(displayState.currentPage)) {
        displayState.currentPage = firstAvailableDashboardPage();
    }

    uint8_t pageId = displayState.currentPage;
    uint8_t themeId = activeThemeIdValue();
    uint32_t staticHash = dashboardStaticHash(pageId);
    uint32_t dynamicHash = dashboardDynamicHash(pageId);

