rpouetpouet/geekmagic-tv-esp8266/src/display.cpp
    bool requiresFullRender = !renderCache.valid ||
                              renderCache.mode != DISPLAY_MODE_DASHBOARD ||
                              renderCache.page != pageId ||
                              renderCache.theme != themeId ||
                              renderCache.staticHash != staticHash;

    if (requiresFullRender) {
        renderDashboardPage();
        renderCache.valid = true;
        renderCache.mode = DISPLAY_MODE_DASHBOARD;
        renderCache.page = pageId;
        renderCache.theme = themeId;
        renderCache.staticHash = staticHash;
        renderCache.dynamicHash = dynamicHash;
        renderCache.imagePath[0] = '\0';
        return;
    }

    if (pageUsesDynamicRefresh(pageId) && renderCache.dynamicHash != dynamicHash) {
        updateDashboardDynamicArea(pageId);
        renderCache.dynamicHash = dynamicHash;
    }
}

}  // namespace

void setBacklightLevel(int brightness, bool rememberPreference, bool shouldLog = true) {
    int boundedBrightness = constrain(brightness, 0, 100);
    if (rememberPreference) {
        savedBrightness = boundedBrightness;
    }

    if (appliedBrightness == boundedBrightness) {
        backlightOn = boundedBrightness > 0;
        return;
    }

    int pwmValue = 0;
    if (boundedBrightness == 0) {
        pwmValue = 1023;
    } else if (boundedBrightness == 100) {
        pwmValue = 0;
    } else {
        pwmValue = map(boundedBrightness, 0, 100, 1023, 0);
    }

    analogWrite(PIN_BACKLIGHT, pwmValue);
    appliedBrightness = boundedBrightness;
    backlightOn = boundedBrightness > 0;
    if (shouldLog) {
        logPrintf("Brightness: %d%%, PWM: %d", boundedBrightness, pwmValue);
    }
}

void animateBacklightRamp(int fromBrightness,
                          int toBrightness,
                          uint8_t steps,
                          uint16_t stepDelayMs) {
    if (steps == 0) {
        setBacklightLevel(toBrightness, false, false);
        return;
    }

    int start = constrain(fromBrightness, 0, 100);
    int target = constrain(toBrightness, 0, 100);
    if (start == target) {
        return;
    }

    for (uint8_t step = 1; step <= steps; ++step) {
        int interpolated = start + ((target - start) * static_cast<int>(step)) / static_cast<int>(steps);
        setBacklightLevel(interpolated, false, false);
        if (stepDelayMs > 0) {
            delay(stepDelayMs);
            yield();
        }
    }
}

int beginPageTransition(int targetBrightness) {
    int startBrightness = constrain(targetBrightness, 0, 100);
    if (startBrightness < kPageTransitionMinimumBrightness) {
        return startBrightness;
    }

    int dimBrightness = max(static_cast<int>(kPageTransitionMinimumBrightness),
                            (startBrightness * static_cast<int>(kPageTransitionDimPercent)) / 100);
    if (dimBrightness >= startBrightness) {
        return startBrightness;
    }

    animateBacklightRamp(startBrightness,
                         dimBrightness,
                         kPageTransitionFadeDownSteps,
                         kPageTransitionFadeStepDelayMs);
    return dimBrightness;
}

void endPageTransition(int transitionBrightness, int targetBrightness) {
    int startBrightness = constrain(transitionBrightness, 0, 100);
    int endBrightness = constrain(targetBrightness, 0, 100);
    if (startBrightness == endBrightness) {
        return;
    }

    delay(8);
    yield();
    animateBacklightRamp(startBrightness,
                         endBrightness,
                         kPageTransitionFadeUpSteps,
                         kPageTransitionFadeStepDelayMs);
}

void displayInit() {
    logPrint(F("Display init..."));

    tft.init();
    tft.setRotation(0);
    tft.invertDisplay(true);
    tft.fillScreen(TFT_BLACK);

    displayState.line2[0] = '\0';
    displayState.ipInfo[0] = '\0';
    displayState.showImage = false;
    displayState.imagePath[0] = '\0';
    displayState.apMode = false;
    displayState.apSSID[0] = '\0';
    displayState.apPassword[0] = '\0';
    displayState.currentPage = DASHBOARD_PAGE_CLOCK;
    clearTemporaryMessage();

    clockDynamicSprite.deleteSprite();
    clockDynamicSpriteReady = false;
    clockDynamicSpriteAttempted = false;
    clockDynamicSpriteAllowed = false;

    pinMode(PIN_BACKLIGHT, OUTPUT);
    analogWriteFreq(1000);
    analogWriteRange(1023);
    displaySetBrightness(100);

    logPrint(F("Display init complete"));
}

void displaySetBrightness(int brightness) {
    setBacklightLevel(brightness, true);
}

void displayApplyBrightness(int brightness) {
    setBacklightLevel(brightness, false);
}

void displaySetClockSpriteAllowed(bool allowed) {
    if (clockDynamicSpriteAllowed == allowed &&
        (!clockDynamicSpriteReady || allowed)) {
        return;
    }

    clockDynamicSpriteAllowed = allowed;
    clockDynamicSpriteAttempted = false;

    if (!allowed) {
        clockDynamicSprite.deleteSprite();
        clockDynamicSpriteReady = false;
    }
}

void displaySuspendDynamicResources() {
    if (dynamicResourceSuspendDepth == 0) {
        resumeClockSpriteAfterDynamicSuspend = clockDynamicSpriteAllowed;
        if (clockDynamicSpriteReady || clockDynamicSpriteAllowed) {
            clockDynamicSprite.deleteSprite();
            clockDynamicSpriteReady = false;
            clockDynamicSpriteAttempted = false;
            clockDynamicSpriteAllowed = false;
            logPrintf("Display resources suspended, free heap now %u", ESP.getFreeHeap());
        }
    }

    if (dynamicResourceSuspendDepth < 255) {
        ++dynamicResourceSuspendDepth;
    }
}

void displayResumeDynamicResources() {
    if (dynamicResourceSuspendDepth == 0) {
        return;
    }

    --dynamicResourceSuspendDepth;
    if (dynamicResourceSuspendDepth != 0) {
        return;
    }

    if (resumeClockSpriteAfterDynamicSuspend) {
        clockDynamicSpriteAllowed = true;
        clockDynamicSpriteAttempted = false;
        resumeClockSpriteAfterDynamicSuspend = false;
    }
}

void displayUpdate() {
    if (temporaryMessageVisible()) {
        uint32_t currentHash = temporaryMessageHash();
        uint8_t themeId = activeThemeIdValue();
        if (renderCache.valid &&
            renderCache.mode == DISPLAY_MODE_TEMP_MESSAGE &&
            renderCache.theme == themeId &&
            renderCache.staticHash == currentHash) {
            return;
        }

