rpouetpouet/geekmagic-tv-esp8266/src/display.cpp
        const ThemePalette &theme = activeTheme();
        drawScreenChrome("SmartClock");
        drawRoundedPanel(12, 48, DISPLAY_WIDTH - 24, 176, theme.surface, theme.surfaceAlt);
        drawWrappedCenteredText(temporaryMessage.message, 120, 92, 192, FONT_BODY, theme.text, theme.surface, 4);

        renderCache.valid = true;
        renderCache.mode = DISPLAY_MODE_TEMP_MESSAGE;
        renderCache.page = 0;
        renderCache.theme = themeId;
        renderCache.staticHash = currentHash;
        renderCache.dynamicHash = 0;
        renderCache.imagePath[0] = '\0';
        return;
    }

    if (temporaryMessageExpired()) {
        clearTemporaryMessage();
        invalidateRenderCache();
    }

    if (displayState.showImage && displayState.imagePath[0] != '\0') {
        if (renderCache.valid &&
            renderCache.mode == DISPLAY_MODE_IMAGE &&
            strcmp(renderCache.imagePath, displayState.imagePath) == 0) {
            return;
        }

        displayRenderImage(displayState.imagePath);
        if (LittleFS.exists(displayState.imagePath)) {
            renderCache.valid = true;
            renderCache.mode = DISPLAY_MODE_IMAGE;
            renderCache.page = 0;
            renderCache.theme = activeThemeIdValue();
            renderCache.staticHash = 0;
            renderCache.dynamicHash = 0;
            strncpy(renderCache.imagePath, displayState.imagePath, sizeof(renderCache.imagePath) - 1);
            renderCache.imagePath[sizeof(renderCache.imagePath) - 1] = '\0';
        }
        return;
    }

    if (displayState.apMode) {
        uint32_t currentHash = apScreenHash();
        uint8_t themeId = activeThemeIdValue();
        if (renderCache.valid &&
            renderCache.mode == DISPLAY_MODE_AP &&
            renderCache.theme == themeId &&
            renderCache.staticHash == currentHash) {
            return;
        }

        displayRenderAPMode();
        renderCache.valid = true;
        renderCache.mode = DISPLAY_MODE_AP;
        renderCache.page = 0;
        renderCache.theme = themeId;
        renderCache.staticHash = currentHash;
        renderCache.dynamicHash = 0;
        renderCache.imagePath[0] = '\0';
        return;
    }

    renderDashboardPageCached();
}

void displayRenderClock() {
    renderClockPage();
}

void displayRenderAPMode() {
    const ThemePalette &theme = activeTheme();
    bool canRevealAdminPassword = authCanRevealPassword();
    const char *adminPassword = authProvisionedPassword();
    String setupIp = displayState.ipInfo[0] != '\0' ? safeCString(displayState.ipInfo) : String("192.168.4.1");
    const int kWideFonts[] = {FONT_BODY, FONT_LABEL, FONT_INFO};
    const int kIpFonts[] = {FONT_INFO};
    const int kCompactFonts[] = {FONT_LABEL, FONT_INFO};

    tft.fillScreen(theme.background);

    tft.fillRoundRect(10, 10, 220, 24, 12, theme.surfaceAlt);
    tft.fillCircle(24, 22, 4, theme.accent);
    tft.setTextDatum(TL_DATUM);
    tft.setTextFont(FONT_INFO);
    tft.setTextColor(theme.text, theme.surfaceAlt);
    tft.drawString("Setup mode", 36, 16, FONT_INFO);

    drawRoundedPanel(10, 42, 220, 60, theme.accentSoft, theme.accentSoft);
    tft.setTextDatum(TC_DATUM);
    tft.setTextFont(FONT_INFO);
    tft.setTextColor(theme.accent, theme.accentSoft);
    tft.drawString("SETUP URL", 120, 52, FONT_INFO);
    drawAdaptiveText(setupIp,
                     120,
                     68,
                     192,
                     TC_DATUM,
                     kIpFonts,
                     sizeof(kIpFonts) / sizeof(kIpFonts[0]),
                     theme.text,
                     theme.accentSoft);
    tft.setTextFont(FONT_INFO);
    tft.setTextColor(theme.muted, theme.accentSoft);
    tft.drawString("Open this in browser", 120, 86, FONT_INFO);

    drawRoundedPanel(10, 108, 134, 50, theme.surface, theme.surfaceAlt);
    tft.setTextDatum(TL_DATUM);
    tft.setTextFont(FONT_INFO);
    tft.setTextColor(theme.muted, theme.surface);
    tft.drawString("WI-FI", 20, 118, FONT_INFO);
    drawAdaptiveText(safeCString(displayState.apSSID),
                     77,
                     136,
                     106,
                     TC_DATUM,
                     kCompactFonts,
                     sizeof(kCompactFonts) / sizeof(kCompactFonts[0]),
                     theme.text,
                     theme.surface);

    drawRoundedPanel(150, 108, 80, 50, theme.surface, theme.surfaceAlt);
    tft.setTextDatum(TC_DATUM);
    tft.setTextFont(FONT_INFO);
    tft.setTextColor(theme.muted, theme.surface);
    tft.drawString("PASS", 190, 118, FONT_INFO);
    drawAdaptiveText(safeCString(displayState.apPassword),
                     190,
                     136,
                     58,
                     TC_DATUM,
                     kWideFonts,
                     sizeof(kWideFonts) / sizeof(kWideFonts[0]),
                     theme.text,
                     theme.surface);

    drawRoundedPanel(10, 168, 220, 62, theme.surfaceAlt, theme.surfaceAlt);
    tft.setTextDatum(TL_DATUM);
    tft.setTextFont(FONT_INFO);
    tft.setTextColor(canRevealAdminPassword ? theme.accent : theme.muted, theme.surfaceAlt);
    tft.drawString("ADMIN LOGIN", 20, 178, FONT_INFO);

    if (canRevealAdminPassword && adminPassword != nullptr && adminPassword[0] != '\0') {
        drawBadge(20, 193, 48, 18, "admin", theme.accentSoft, theme.accent);
        drawAdaptiveText(safeCString(adminPassword),
                         220,
                         191,
                         138,
                         TR_DATUM,
                         kWideFonts,
                         sizeof(kWideFonts) / sizeof(kWideFonts[0]),
                         theme.text,
                         theme.surfaceAlt);

        tft.setTextDatum(TL_DATUM);
        tft.setTextFont(FONT_INFO);
        tft.setTextColor(theme.muted, theme.surfaceAlt);
        tft.drawString("Use this password on the dashboard.", 20, 212, FONT_INFO);
        return;
    }

    drawWrappedCenteredText("Use your saved admin password after Wi-Fi setup.",
                            120,
                            194,
                            192,
                            FONT_INFO,
                            theme.muted,
                            theme.surfaceAlt,
                            2);
}

void displayBlankScreen() {
    clearTemporaryMessage();
    tft.fillScreen(TFT_BLACK);
    invalidateRenderCache();
    logPrint(F("Display blanked to black."));
}

// Read callback for picojpeg
static File jpegFile;
static unsigned char jpegReadCallback(unsigned char* pBuf, unsigned char buf_size, unsigned char *pBytesActuallyRead, void *pCallbackData) {
    (void)pCallbackData;
    *pBytesActuallyRead = jpegFile.read(pBuf, buf_size);
    return 0;
}

void displayRenderImage(const char *path) {
    if (!LittleFS.exists(path)) {
        displayShowMessage(F("Image not found"));
        return;
    }

