rpouetpouet/geekmagic-tv-esp8266/src/display.cpp
    jpegFile = LittleFS.open(path, "r");
    if (!jpegFile) {
        displayShowMessage(String(F("Failed to open\n")) + path);
        return;
    }

    pjpeg_image_info_t imgInfo;
    uint8_t result = pjpeg_decode_init(&imgInfo, jpegReadCallback, NULL, 0);
    if (result != 0) {
        jpegFile.close();
        displayShowMessage(String(F("JPEG init error\n")) + String(result));
        return;
    }

    // Calculate scale (nearest-neighbour subsample factor)
    const int displayW = 240, displayH = 240;
    uint8_t scale = 1;
    while ((imgInfo.m_width / scale > displayW || imgInfo.m_height / scale > displayH) && scale < 8) {
        scale *= 2;
    }

    int outW = imgInfo.m_width / scale;
    int outH = imgInfo.m_height / scale;
    int xOffset = (displayW - outW) / 2;
    int yOffset = (displayH - outH) / 2;

    int mcuW = imgInfo.m_MCUWidth;
    int mcuH = imgInfo.m_MCUHeight;
    int mcuOutW = mcuW / scale;
    int mcuOutH = mcuH / scale;

    tft.setSwapBytes(true);
    tft.startWrite();

    for (int mcuRow = 0; mcuRow < imgInfo.m_MCUSPerCol; mcuRow++) {
        for (int mcuCol = 0; mcuCol < imgInfo.m_MCUSPerRow; mcuCol++) {
            result = pjpeg_decode_mcu();
            if (result != 0 && result != PJPG_NO_MORE_BLOCKS) {
                tft.endWrite();
                jpegFile.close();
                displayShowMessage(String(F("JPEG error\n")) + String(result));
                return;
            }

            // Render MCU: blit each 8x8 block into a tile buffer, then pushImage
            uint16_t tileBuf[mcuOutW * mcuOutH];
            int blocksPerRow = mcuW / 8;
            int blocksPerCol = mcuH / 8;

            for (int by = 0; by < blocksPerCol; by++) {
                for (int bx = 0; bx < blocksPerRow; bx++) {
                    int blockIdx = by * blocksPerRow + bx;
                    uint8_t *rBlk = imgInfo.m_pMCUBufR + blockIdx * 64;
                    uint8_t *gBlk = imgInfo.m_pMCUBufG + blockIdx * 64;
                    uint8_t *bBlk = imgInfo.m_pMCUBufB + blockIdx * 64;

                    // Nearest-neighbour subsample this 8x8 block
                    for (int py = 0; py < 8; py += scale) {
                        for (int px = 0; px < 8; px += scale) {
                            int tX = bx * 8 / scale + px / scale;
                            int tY = by * 8 / scale + py / scale;
                            int pixIdx = py * 8 + px;
                            tileBuf[tY * mcuOutW + tX] = tft.color565(
                                rBlk[pixIdx], gBlk[pixIdx], bBlk[pixIdx]
                            );
                        }
                    }
                }
            }

            int screenX = mcuCol * mcuOutW + xOffset;
            int screenY = mcuRow * mcuOutH + yOffset;
            tft.pushImage(screenX, screenY, mcuOutW, mcuOutH, tileBuf);
        }
    }

    tft.endWrite();
    jpegFile.close();
}

void displayShowMessage(const String &msg) {
    clearTemporaryMessage();
    const ThemePalette &theme = activeTheme();
    drawScreenChrome("SmartClock");
    drawRoundedPanel(18, 54, 204, 144, theme.surface, theme.surfaceAlt);
    drawWrappedCenteredText(msg, 120, 96, 170, FONT_BODY, theme.text, theme.surface, 4);
    invalidateRenderCache();
}

void displayShowTemporaryMessage(const String &msg, uint32_t durationMs) {
    strncpy(temporaryMessage.message, msg.c_str(), sizeof(temporaryMessage.message) - 1);
    temporaryMessage.message[sizeof(temporaryMessage.message) - 1] = '\0';
    temporaryMessage.active = temporaryMessage.message[0] != '\0';
    temporaryMessage.expiresAtMs = millis() + (durationMs > 0 ? durationMs : 1000UL);
    invalidateRenderCache();
    displayUpdate();
}

void displayShowAPScreen(const char *ssid, const char *password, const char *ip) {
    displayState.apMode = true;
    displayState.showImage = false;
    strncpy(displayState.apSSID, ssid, sizeof(displayState.apSSID) - 1);
    displayState.apSSID[sizeof(displayState.apSSID) - 1] = '\0';
    strncpy(displayState.apPassword, password, sizeof(displayState.apPassword) - 1);
    displayState.apPassword[sizeof(displayState.apPassword) - 1] = '\0';
    strncpy(displayState.ipInfo, ip, sizeof(displayState.ipInfo) - 1);
    displayState.ipInfo[sizeof(displayState.ipInfo) - 1] = '\0';
    invalidateRenderCache();
    displayUpdate();
}

void displayCycleNextPage(bool smoothTransition) {
    if (temporaryMessageVisible()) {
        logPrint(F("Page cycling disabled while temporary message is active"));
        return;
    }

    if (displayState.apMode) {
        logPrint(F("Page cycling disabled in AP mode"));
        return;
    }

    if (displayState.showImage) {
        displayState.showImage = false;
        displayState.currentPage = firstAvailableDashboardPage();
        invalidateRenderCache();
        displayUpdate();
        return;
    }

    uint8_t previousPage = displayState.currentPage;
    if (!dashboardPageAvailable(displayState.currentPage)) {
        displayState.currentPage = firstAvailableDashboardPage();
    } else {
        displayState.currentPage = nextAvailableDashboardPage(displayState.currentPage);
    }

    if (displayState.currentPage == previousPage) {
        return;
    }

    int targetBrightness = appliedBrightness;
    int transitionBrightness = targetBrightness;
    if (smoothTransition) {
        transitionBrightness = beginPageTransition(targetBrightness);
    }

    invalidateRenderCache();
    displayUpdate();
    if (smoothTransition) {
        endPageTransition(transitionBrightness, targetBrightness);
    }
}

void displayToggleBacklight() {
    if (backlightOn) {
        logPrint(F("Backlight OFF"));
        displayApplyBrightness(0);
    } else {
        logPrintf("Backlight ON (brightness: %d)", savedBrightness);
        displayApplyBrightness(savedBrightness > 0 ? savedBrightness : 100);
    }
}
